app/controllers/session_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "za@za.fr"], ["LIMIT", 1]]
---
  def create # login(create un session login)

    mail = params[:mailaka]
    login = User.find_by(email: mail)